[
    {
        "date": "2020-09-17",
        "title": "Ottogi: Yeul Ramen (Super Spicy)",
        "content": {
            "text": "<img id=\"ramen-bag\" class=\"blog-image\" src=\"img/dabby/ramen-blog/2020-09-17/bag.png\"><p id=\"ramen-bag-content\" class=\"blog-content\">This is going to be my first review, and we are setting the bar pretty low today. I am reviewing Ottogi brand yeul ramen. According to the packaging, this ramen should be super spicy: a claim I will be testing. The bag feels nice to my bony fingers. Crinkling loud and clear for my spoopy cats to hear. They came to investigate and managed to steal my right arm.</p><img id=\"ramen-ingredients\" class=\"blog-image\" src=\"img/dabby/ramen-blog/2020-09-17/ingredients.png\"><p id=\"ramen-ingredients-content\" class=\"blog-content\">The noodles are a classic mix of wheat flour, tapioca, various starches, and wheat gluten. The soup mix is a mix of spice and other flavors. The spice is made up of a mix of red pepper, black pepper, and chili extract. Other flavors include kelp extract, dried chinese cabbage, and garlic. One interesting ingredient is green tea extract at the end. Is this normal? I don't have a clue. I'm just a bone daddy looking for a tasty time.</p><img id=\"ramen-nutrition-facts\" class=\"blog-image\" src=\"img/dabby/ramen-blog/2020-09-17/nutrition-facts.png\"><p id=\"ramen-nutrition-facts-content\" class=\"blog-content\">20mg calcium.</p><img id=\"ramen-stove\" class=\"blog-image\" src=\"img/dabby/ramen-blog/2020-09-17/stove.png\"><p id=\"ramen-stove-content\" class=\"blog-content\">Once the water started boiling, I tossed in the contents of the soup packets and started mixing. I couldn't smell anything as it cooked. I wouldn't blame the ramen for my lack of olfaction.</p><img id=\"ramen-bowl\" class=\"blog-image\" src=\"img/dabby/ramen-blog/2020-09-17/bowl.png\"><p id=\"ramen-bowl-content\" class=\"blog-content\">After 4 minutes of cooking, was it worth it? The noodles were boring and thin. They barely seem to have increased in volume after cooking. Was it super spicy? Hardly. I downed the bowl and it may have left my jawbone red, but it failed to burn through the flesh I have left. One unique characteristic was the broth itself. It tasted quite similar to kimchi, stronger in flavor than other ramen broths I have encountered before. While not very spicy, the broth was uniquely flavorful and the noodles were standard fare. <i>4/10</i></p>"
        }
    }
]