[
  {
    "date": "2020-08-20",
    "title": "Hello World!",
    "content": {
      "text": "<p>I have really been chipping away at this site for a bit. I have wanted a place to dump my thoughts and projects for a long time now, and it is finally here! Thank you for being willing to listen to my musings.<br></br>Will I post at a consistent rate? Of course not, I struggle to remember to eat during a given day. Typing into this void of a webpage is going to occur when extra-special super awesome glints of mania push me to dump my thoughts.</p><p>This first one was a short one, and far from the best one.</p>"
    }
  },
  {
    "date": "2020-08-22",
    "title": "Coffee grounds, vodka sauce, and daydreams",
    "content": {
      "text": "<p>The morning has been an interesting one. I woke up around 11 am after a late night of <a href=\"https://mst3k.com\">Mystery Science Theater 3000</a>. I got up, dressed, and went to do the dishes. I got to the end and lo, some unholy, moldy coffee grounds needed dealt with. My ignorant mind said, \"THROW THEM IN THE HOLE!\", and down they went into the disposal. I turned it on and the hum of death went <i>brrrrrrrr</i>. Maintenance came by and found it wasn't the grounds, but it was sticks...sticks...from outside. My wife has collected sticks on occasion, and we believe our kitties must have dropped the sticks into the disposal as an act of rebellion.<br></br>With my first-world problem resolved, I started on some pasta and meatballs. Vodka sauce has become a secret passion of mine. We found some vegan vodka sauce at Whole Foods, and the meatballs are just the Gardein branch frozen meatballs. I always make <a href=\"https://www.thekitchn.com/instant-pot-spaghetti-264230\">pasta in the Instant Pot</a> and I can't recommend it enough.<br></br>With the pasta done and the rest of the Saturday ahead of me, I think I will daydream about making games and start <a href=\"https://en.wikipedia.org/wiki/Twin_Peaks\">Twin Peaks</a>.</p>"
    }
  },
  {
    "date": "2020-08-27",
    "title": "Flashy Ideas",
    "content": {
      "text": "<p>Have you ever been playing Blaseball when something really tugged at your heart and made you ask, \"Where am I going to play Papa's Pizzeria after December 2020?\"<br></br>Many browsers are <a href=\"https://support.google.com/chrome/a/answer/7084871\">ending Flash support</a> come December of this year. My generation grew up on these games, and I would argue that these games paved the way for the modern indie video game market. The newest generation won't have these games, but instead has the Android and Apple app stores. Maybe I have nostalgia blinders, but I really do believe that the mediocre titles of the Flash era either matched, or at least came near to matching the quality of modern mobile games. Many influential mobile games even started as Flash, such as Kingdom Rush, Canabalt, and Bloons Tower Defense.<br></br>Flash is not inherently good. From a technical standpoint, we have made incredible progress in enabling developers to build their creations beyond the likes of Flash. The spirit of Flash is what was special. Before commercialization and ad profits entered the picture, these games were made by developers with simple wishes to share their dreams with others.<br></br>I work on games in the hopes of pushing myself and others to do this very thing. In the memory of Flash, I will continue to recreate my favorite Flash games on this site, and hopefully bring some unique creations up along the way.</p>"
    }
  },
  {
    "date": "2021-02-02",
    "title": "Oh dear",
    "content": {
      "text": "<p>Oh dear Lord there has been a lot since last time. Amongst an insurrection on the US capitol and a stock war over GameStop, my wife and I bought a house and got a third cat, Fish.<br></br>I learned a few new programming languages including two new favorites of mine: <a href=\"https://www.scala-lang.org\">Scala</a> and <a href=\"https://www.nim-lang.org\">Nim<a> (<i>All good languages seem to have website domains of the form www.[language name here]-lang.com</i>). I mostly ported the Komodo game engine to Scala using LibGDX and only gave up once Java UI threads were getting in the way of easy UI development. It was fun and all, but I think the real winner and final home for the Komodo engine is with Nim.<br></br>Nim satisfies my urge to write what looks like pseudocode while enjoying the benefits of a statically typed and compiled language. No attempt by the Nim developers to make a compiler smarter than two of some of the largest open-source communities (<a href=\"https://gcc.gnu.org/\">GCC</a> and <a href=\"https://clang.llvm.org/\">Clang</a>), but instead harnesses these behemoths by simply generating C-family code and passing it off to your local system compiler. With a powerful macro system, Komodo has never looked better and I am excited to see what can be done with Nim and Raylib.<br></br>Apart from code, my life has changed in other ways. My teammates at work left for other teams or other companies, leaving me alone to develop and maintain an app servicing a workforce around ~2,000 strong. I am excited to say that this will not be the case forever, as I will be transitioning to an SRE position once my project is ready to hand off to a new team. Work is great. Life is great. For those who cannot say these same things for themselves, reach out to those who love you and have faith that this will all come to an end eventually.</p>"
    }
  },
  {
    "date": "2021-03-30",
    "title": "Two blogs in two months, nice",
    "content": {
      "text": "<p>Somehow my blog posting is more consistent than I expected it would be and that is sad. Like always, a lot has been going on in my life with much of it being generally positive. I am currently transitioning off of the team I started on at my work. I thought I would be more nostalgic in this moment, but I am simply relieved. Feature development for users is not my cup of tea any longer. I have been steeping myself deeper and deeper into different programming languages (primarily <a href=\"https://www.nim-lang.org\">Nim</a> and <a href=\"https://www.elm-lang.org\">Elm</a>) and even found a new code editor I intend to slowly replace <a href=\"https://code.visualstudio.com\">VSCode</a> with (the editor is called <a href=\"https://github.com/rxi/lite\">Lite</a>, but I am specifically using the <a href=\"https://github.com/franko/lite-xl\">Lite-XL</a> fork). Needless to say, the technology I use in my life is in a constant state of change and I wouldn't have it any other way.<br></br>From a non-technical standpoint, I have some general exciting life updates! I have struggled with my weight for my entire life. I have been a vegan for the past few years, experienced some improvement in general with my health, but I was still struggling to fight my food addiction and lose weight. I had been spiralling in private, feeling hopeless and getting scared I would end up like many others around me who never got their weight under control. After watching the documentary <a href=\"https://www.imdb.com/title/tt11295178\">Diet Fiction</a>, I decided to remove processed foods from my life and eat just whole foods. Eating only whole foods has had both a physical and spiritual effect on me already. I was 277 lbs on March 5th, and over the course of this month I have steadily dropped down to 262.2 lbs and I intend to keep going. My mood has improved, my energy levels have skyrocketed, and my understanding of food has changed forever.<br></br>My wife and I have also been making great progress on our backyard homestead and these two things combined are prompting me to think. As a Christian, I have been thinking about what eating only whole foods means from a spiritual perspective and my thoughts are best summed up in this nearly <a href=\"https://www.youtube.com/watch?v=6rPPUmStKQ4\">two hour documentary on YouTube</a>. As succinctly as possible, eating whole foods and my wife and I's work to grow our household's food are driven by an innate desire to connect with the roles and skills God imbued us with as stewards of the Earth. It is hard to argue against the damage humans have caused throughout all of history, and maybe the answer to humanity's environmental woes lies in the creation narrative. The spiritual aspects of this will not connect for everyone, but the benefits of growing your own food and consuming what comes from the Earth can be taken on their own merits.<br></br>Do I believe processed foods are inherently evil? No.<br></br>Do I believe you can't live a healthy life unless you only eat whole foods? Of course not.<br></br>Though, I leave you with a question to ask yourself: Why do humans act as if we are not a party <em>within</em> nature, but rather some strictly destructive <em>external</em> force on nature?</p>"
    }
  }
]
